taskt/Core/Automation/Commands/UIAutomationGroup/ADescendantsSearchAnyUIElementFromWindowHandleByTreeWalkerCommands.dot
digraph "ADescendantsSearchAnyUIElementFromWindowHandleByTreeWalkerCommands" {
"ADescendantsSearchAnyUIElementFromWindowHandleByTreeWalkerCommands" -> "ADescendantsSearchUIElementsFromWindowHandleByTreeWalkerCommands";
"ADescendantsSearchAnyUIElementFromWindowHandleByTreeWalkerCommands" -> "IUIElementIndexProperties";
"ADescendantsSearchUIElementsFromWindowHandleByTreeWalkerCommands" -> "ADescendantsSearchUIElementsFromSomethingByTreeWalkerCommands";
"ADescendantsSearchUIElementsFromWindowHandleByTreeWalkerCommands" -> "IWindowHandleProperties";
"ADescendantsSearchUIElementsFromWindowHandleByTreeWalkerCommands" -> "IUIElementSearchUIElementFromWindowSomethingByAnywayProperties";
"ADescendantsSearchUIElementsFromSomethingByTreeWalkerCommands" -> "AChildrenSearchUIElementsFromSomethingByTreeWalkerCommands";
"ADescendantsSearchUIElementsFromSomethingByTreeWalkerCommands" -> "IUIElementDescendantsSearchParametersProperties";
"AChildrenSearchUIElementsFromSomethingByTreeWalkerCommands" -> "ScriptCommand";
"AChildrenSearchUIElementsFromSomethingByTreeWalkerCommands" -> "IUIElementChildrenSearchParametersProperties";
"ScriptCommand" -> "IUIParameterProperties";
"ScriptCommand" -> "ICommandIDProperties";
}
