taskt/Core/Automation/Commands/UIAutomationGroup/ADescendantsSearchAnyUIElementFromWindowHandleByTreeWalkerCommands.puml
@startuml
ADescendantsSearchAnyUIElementFromWindowHandleByTreeWalkerCommands --> ADescendantsSearchUIElementsFromWindowHandleByTreeWalkerCommands
ADescendantsSearchAnyUIElementFromWindowHandleByTreeWalkerCommands --> IUIElementIndexProperties
ADescendantsSearchUIElementsFromWindowHandleByTreeWalkerCommands --> ADescendantsSearchUIElementsFromSomethingByTreeWalkerCommands
ADescendantsSearchUIElementsFromWindowHandleByTreeWalkerCommands --> IWindowHandleProperties
ADescendantsSearchUIElementsFromWindowHandleByTreeWalkerCommands --> IUIElementSearchUIElementFromWindowSomethingByAnywayProperties
ADescendantsSearchUIElementsFromSomethingByTreeWalkerCommands --> AChildrenSearchUIElementsFromSomethingByTreeWalkerCommands
ADescendantsSearchUIElementsFromSomethingByTreeWalkerCommands --> IUIElementDescendantsSearchParametersProperties
AChildrenSearchUIElementsFromSomethingByTreeWalkerCommands --> ScriptCommand
AChildrenSearchUIElementsFromSomethingByTreeWalkerCommands --> IUIElementChildrenSearchParametersProperties
ScriptCommand --> IUIParameterProperties
ScriptCommand --> ICommandIDProperties
@enduml
